In [1]:
import pandas as pd
import numpy as np

In [10]:
w = pd.DataFrame({1: ["td", "bd"], '1': ["tc", "bc"]})

In [11]:
w

    1   1
0  td  tc
1  bd  bc

In [4]:
w[1]

0    td
1    bd
Name: 1, dtype: object

In [5]:
w["1"]

0    tc
1    bc
Name: 1, dtype: object

In [6]:
w[1:]

    1   1
1  bd  bc

In [7]:
w.T

    0   1
1  td  bd
1  tc  bc